GreatCowBASIC/DATFileGenerator/incfiles/p16F17176.inc
;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- TRISD Bits -----------------------------------------------------
TRISD0           EQU  H'0000'
TRISD1           EQU  H'0001'
TRISD2           EQU  H'0002'
TRISD3           EQU  H'0003'
TRISD4           EQU  H'0004'
TRISD5           EQU  H'0005'
TRISD6           EQU  H'0006'
TRISD7           EQU  H'0007'


;----- TRISE Bits -----------------------------------------------------
TRISE0           EQU  H'0000'
TRISE1           EQU  H'0001'
TRISE2           EQU  H'0002'
TRISE3           EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- LATD Bits -----------------------------------------------------
LATD0            EQU  H'0000'
LATD1            EQU  H'0001'
LATD2            EQU  H'0002'
LATD3            EQU  H'0003'
LATD4            EQU  H'0004'
LATD5            EQU  H'0005'
LATD6            EQU  H'0006'
LATD7            EQU  H'0007'


;----- LATE Bits -----------------------------------------------------
LATE0            EQU  H'0000'
LATE1            EQU  H'0001'
LATE2            EQU  H'0002'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR2 Bits -----------------------------------------------------
TMR3IF           EQU  H'0000'
TMR3GIF          EQU  H'0001'
TMR2IF           EQU  H'0002'
TMR4IF           EQU  H'0003'
TMR6IF           EQU  H'0004'
CCP1IF           EQU  H'0005'
CCP2IF           EQU  H'0006'


;----- PIR3 Bits -----------------------------------------------------
PWM1PIF          EQU  H'0000'
PWM1IF           EQU  H'0001'
PWM2PIF          EQU  H'0002'
PWM2IF           EQU  H'0003'
PWM3PIF          EQU  H'0004'
PWM3IF           EQU  H'0005'
PWM4PIF          EQU  H'0006'
PWM4IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
NCO1IF           EQU  H'0000'
CWG1IF           EQU  H'0001'
CLC1IF           EQU  H'0002'
CLC2IF           EQU  H'0003'
CLC3IF           EQU  H'0004'
CLC4IF           EQU  H'0005'
TX1IF            EQU  H'0006'
RC1IF            EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
TX2IF            EQU  H'0000'
RC2IF            EQU  H'0001'
SSP1IF           EQU  H'0002'
BCL1IF           EQU  H'0003'
SSP2IF           EQU  H'0004'
BCL2IF           EQU  H'0005'
CM1IF            EQU  H'0006'
CM2IF            EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
ADIF             EQU  H'0000'
ADTIF            EQU  H'0001'
ZCDIF            EQU  H'0002'


;----- PIE0 Bits -----------------------------------------------------
INTE             EQU  H'0000'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'


;----- PIE2 Bits -----------------------------------------------------
TMR3IE           EQU  H'0000'
TMR3GIE          EQU  H'0001'
TMR2IE           EQU  H'0002'
TMR4IE           EQU  H'0003'
TMR6IE           EQU  H'0004'
CCP1IE           EQU  H'0005'
CCP2IE           EQU  H'0006'


;----- PIE3 Bits -----------------------------------------------------
PWM1PIE          EQU  H'0000'
PWM1IE           EQU  H'0001'
PWM2PIE          EQU  H'0002'
PWM2IE           EQU  H'0003'
PWM3PIE          EQU  H'0004'
PWM3IE           EQU  H'0005'
PWM4PIE          EQU  H'0006'
PWM4IE           EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
NCO1IE           EQU  H'0000'
CWG1IE           EQU  H'0001'
CLC1IE           EQU  H'0002'
CLC2IE           EQU  H'0003'
CLC3IE           EQU  H'0004'
CLC4IE           EQU  H'0005'
TX1IE            EQU  H'0006'
RC1IE            EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
TX2IE            EQU  H'0000'
RC2IE            EQU  H'0001'
SSP1IE           EQU  H'0002'
BCL1IE           EQU  H'0003'
SSP2IE           EQU  H'0004'
BCL2IE           EQU  H'0005'
CM1IE            EQU  H'0006'
CM2IE            EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
ADIE             EQU  H'0000'
ADTIE            EQU  H'0001'
ZCDIE            EQU  H'0002'


;----- PMD0 Bits -----------------------------------------------------
NVMMD            EQU  H'0000'
CRCMD            EQU  H'0001'
SCANMD           EQU  H'0002'
SYSCMD           EQU  H'0003'
ACTMD            EQU  H'0004'
IOCMD            EQU  H'0005'
CLKRMD           EQU  H'0006'
TMR0MD           EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
PWM2MD           EQU  H'0000'
PWM3MD           EQU  H'0001'
PWM4MD           EQU  H'0002'
NCO1MD           EQU  H'0003'
CWG1MD           EQU  H'0004'
CLC1MD           EQU  H'0005'
CLC2MD           EQU  H'0006'
CLC3MD           EQU  H'0007'


